raster.tex
% Created 2013-02-11 lun 13:21
\documentclass[xcolor={usenames,svgnames,dvipsnames}]{beamer}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{fixltx2e}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{float}
\usepackage{wrapfig}
\usepackage{soul}
\usepackage{textcomp}
\usepackage{marvosym}
\usepackage{wasysym}
\usepackage{latexsym}
\usepackage{amssymb}
\usepackage{hyperref}
\tolerance=1000
\usepackage{color}
\usepackage{listings}
\AtBeginSubsection[]{\begin{frame}[plain]\tableofcontents[currentsubsection]\end{frame}}
\lstset{commentstyle=\color{gray!90}, basicstyle=\ttfamily\small, columns=fullflexible, breaklines=true,linewidth=\textwidth, backgroundcolor=\color{gray!23}, basewidth={0.5em,0.4em}, literate={á}{{\'a}}1 {ñ}{{\~n}}1 {é}{{\'e}}1 {ó}{{\'o}}1 {º}{{\textordmasculine}}1}
\usepackage{mathpazo}
\setbeamercovered{transparent}
\usefonttheme{serif} 
\usetheme{Goettingen}
\hypersetup{colorlinks=true, linkcolor=Blue, urlcolor=Blue}
\providecommand{\alert}[1]{\textbf{#1}}

\title{Uso de datos raster}
\author{Oscar Perpiñán Lamigueiro}
\date{\today}
\hypersetup{
  pdfkeywords={},
  pdfsubject={},
  pdfcreator={Emacs Org-mode version 7.8.09}}

\begin{document}

\maketitle


\section{Puesta en marcha}
\label{sec-1}
\begin{frame}
\frametitle{Descargar datos de CM\~{}SAF}
\label{sec-1-1}

\begin{itemize}
\item CM\~{}SAF: \href{http://www.cmsaf.eu/}{http://www.cmsaf.eu/}
\item Piden registro (gratuito) para descarga de datos masivos.
\item Está disponible en \href{http://re.jrc.ec.europa.eu/pvgis/apps4/pvest.php}{PV-GIS} (sólo datos puntuales).
\item Hay que elegir el producto SIS (Surface incoming short-wave radiation).
\begin{itemize}
\item Para el ejemplo: medias mensuales del 2008 abarcando la Península Ibérica.
\item \emph{Operational product}
\item Fuente Seviri/MSG2.
\item Resolución: 0.03 x 0.03 grados.
\end{itemize}
\item El conjunto de ficheros estará disponible vía FTP transcurrido un tiempo.
\end{itemize}
\end{frame}
\begin{frame}
\frametitle{Disponible en el material del curso}
\label{sec-1-2}

\begin{itemize}
\item Como ZIP aislado del \href{https://github.com/oscarperpinan/intro}{repositorio github}: \href{https://github.com/oscarperpinan/intro/blob/master/data/SISmm2008_CMSAF.zip?raw=true}{SISmm2008\_CMSAF.zip}
\item Mejor y más fácil: \href{https://github.com/oscarperpinan/intro/archive/master.zip}{descargar todo el repositorio} y descomprimir el ZIP en una carpeta (por ejemplo \texttt{C:/intro}).
\begin{itemize}
\item El ZIP de datos CM\~{}SAF está dentro de la carpeta \texttt{data}.
\end{itemize}
\end{itemize}
\end{frame}
\begin{frame}[fragile]
\frametitle{Primeros pasos en R}
\label{sec-1-3}

\begin{itemize}
\item Configuramos el directorio de trabajo
\end{itemize}

\lstset{language=R}
\begin{lstlisting}
## Entre las comillas hay que indicar el directorio en el que está el
## fichero SISmm2008_CMSAF.zip.
setwd('C:/intro/data')
\end{lstlisting}
\begin{itemize}
\item Cargo los paquetes que usaremos
\end{itemize}

\lstset{language=R}
\begin{lstlisting}
## Si no están instalados hay que usar install.packages('Nombre_del_Paquete')
library("lattice")
library("latticeExtra")

library("sp")

library("raster")
library("rasterVis")
\end{lstlisting}
\end{frame}
\section{Empiezan los cálculos}
\label{sec-2}

  
\begin{frame}[fragile]
\frametitle{Leo los ficheros CM\~{}SAF}
\label{sec-2-1}


\lstset{language=R}
\begin{lstlisting}
unzip("SISmm2008_CMSAF.zip")
listFich <- dir(pattern=".nc")
stackSIS <- stack(listFich)
## irradiancia (W/m2) a irradiacion Wh/m2
stackSIS <- stackSIS*24
\end{lstlisting}
\end{frame}
\begin{frame}[fragile]
\frametitle{Añado información temporal}
\label{sec-2-2}


\lstset{language=R}
\begin{lstlisting}
idx <- seq(as.Date("2008-01-15"),
           as.Date("2008-12-15"),
           "month")

SISmm <- setZ(stackSIS, idx)
\end{lstlisting}
\end{frame}
\begin{frame}[fragile]
\frametitle{Fijo la proyección de trabajo y nombres de capas}
\label{sec-2-3}


\lstset{language=R}
\begin{lstlisting}
proj <- CRS("+proj=longlat +ellps=WGS84")
projection(SISmm) <- proj
names(SISmm) <- month.abb
\end{lstlisting}
\end{frame}
\begin{frame}[fragile]
\frametitle{Veamos la información}
\label{sec-2-4}

\begin{itemize}
\item Mapa clásico
\end{itemize}

\lstset{language=R}
\begin{lstlisting}
levelplot(SISmm)
\end{lstlisting}
\begin{itemize}
\item Densidad de probabilidad por capa (mes)
\end{itemize}

\lstset{language=R}
\begin{lstlisting}
densityplot(SISmm)
\end{lstlisting}
\end{frame}
\begin{frame}[fragile]
\frametitle{Más sobre visualización}
\label{sec-2-5}

\begin{itemize}
\item Gráfico Hovmoller (tiempo-latitud)
\end{itemize}

\lstset{language=R}
\begin{lstlisting}
hovmoller(SISmm, dirXY=y,
          panel=panel.2dsmoother, n=1000)
\end{lstlisting}
\begin{itemize}
\item Gráfico Hovmoller (tiempo-longitud)
\end{itemize}

\lstset{language=R}
\begin{lstlisting}
hovmoller(SISmm, dirXY=x,
          panel=panel.2dsmoother, n=1000)
\end{lstlisting}
\end{frame}
\begin{frame}[fragile]
\frametitle{Calculamos el valor anual por celda}
\label{sec-2-6}

\begin{itemize}
\item No del todo correcto (cada mes tiene un número diferente de días)
\end{itemize}

\lstset{language=R}
\begin{lstlisting}
SISy <- mean(SISmm) * 365/1000
\end{lstlisting}
\begin{itemize}
\item Mejorado
\end{itemize}

\lstset{language=R}
\begin{lstlisting}
SISy <-  sum(SISmm *
             c(31, 28, 31, 30, 31, 30, 31, 31, 30, 31, 30, 31))/1000
names(SISy) <- 'G0'
\end{lstlisting}
\end{frame}
\begin{frame}[fragile]
\frametitle{Veamos la radiación anual}
\label{sec-2-7}

\begin{itemize}
\item Relación con la longitud y la latitud
\end{itemize}

\lstset{language=R}
\begin{lstlisting}
xyplot(G0 ~ y, data=SISy)
xyplot(G0 ~ x, data=SISy)
\end{lstlisting}
\begin{itemize}
\item Distribución de valores
\end{itemize}

\lstset{language=R}
\begin{lstlisting}
histogram(SISy)
\end{lstlisting}
\end{frame}
\section{Combinación de un \texttt{Raster} con puntos (estaciones)}
\label{sec-3}
\begin{frame}[fragile]
\frametitle{Extraemos información de un punto}
\label{sec-3-1}


\lstset{language=R}
\begin{lstlisting}
myPoint <- cbind(-3.6, 40.1)
extract(SISmm, myPoint)
\end{lstlisting}
\end{frame}
\begin{frame}[fragile]
\frametitle{Extraemos información de varios puntos}
\label{sec-3-2}


\lstset{language=R}
\begin{lstlisting}
myLocs <- cbind(-8, 38:43)
SISlocs <- extract(SISmm, myLocs)
\end{lstlisting}
\begin{itemize}
\item Superponemos mapa global con la localización de los puntos
\end{itemize}

\lstset{language=R}
\begin{lstlisting}
levelplot(SISy) +
  layer(sp.points(myLocs,
                  pch=16, col='black'))
\end{lstlisting}
\end{frame}
\begin{frame}[fragile]
\frametitle{Extraemos información de una rejilla}
\label{sec-3-3}


\lstset{language=R}
\begin{lstlisting}
extent(SISmm)
myGrid <- expand.grid(long=-10:4, lat=36:44)
SISgrid <- extract(SISmm, myGrid)
\end{lstlisting}
\begin{itemize}
\item Nuevamente superponemos mapa y rejilla
\end{itemize}

\lstset{language=R}
\begin{lstlisting}
levelplot(SISy) +
  layer(sp.points(myGrid,
                  pch=16, col='black'))
\end{lstlisting}
\end{frame}
\section{Avanzado: CM\~{}SAF y SIAR}
\label{sec-4}
\begin{frame}[fragile]
\frametitle{Estaciones MAGRAMA-SIAR}
\label{sec-4-1}

\begin{itemize}
\item Descargamos localización de las estaciones SIAR
\end{itemize}

\lstset{language=R}
\begin{lstlisting}
## Si no hemos descargado el respositorio GitHub
SIAR <- read.csv("http://solar.r-forge.r-project.org/data/SIAR.csv")
## Si ya lo hemos descargado está en data
SIAR <- read.csv("data/SIAR.csv")
\end{lstlisting}
\begin{itemize}
\item Construimos un objeto espacial con la información y las coordenadas
\end{itemize}

\lstset{language=R}
\begin{lstlisting}
spSIAR <- SpatialPointsDataFrame(SIAR[, c(6, 7)],
                                 SIAR[, -c(6, 7)],
                                 proj4str=proj)
head(spSIAR)
\end{lstlisting}
\begin{itemize}
\item Mostramos el mapa de radiación anual con las estaciones SIAR
\end{itemize}

\lstset{language=R}
\begin{lstlisting}
levelplot(SISy, layers='Jun') +
  layer(sp.points(spSIAR,
                  pch=19, col='black', cex=0.6))
\end{lstlisting}
  
\end{frame}
\begin{frame}[fragile]
\frametitle{Extraemos información de CM\~{}SAF}
\label{sec-4-2}


\lstset{language=R}
\begin{lstlisting}
CMSAF.SIAR <- extract(SISmm, spSIAR)
CMSAF.SIAR <- zoo(t(CMSAF.SIAR), as.yearmon(idx))
names(CMSAF.SIAR) <- spSIAR$Estacion
summary(CMSAF.SIAR)
\end{lstlisting}
\end{frame}
\begin{frame}[fragile]
\frametitle{Particularizamos para una estación}
\label{sec-4-3}

\begin{itemize}
\item Primero extraemos información para la estación de Madrid
\end{itemize}

\lstset{language=R}
\begin{lstlisting}
madridSIAR <- subset(SIAR, Provincia == "Madrid")
spMadrid <- SpatialPoints(
              madridSIAR[, c('lon', 'lat')],
              proj4str=proj)
CMSAFMadrid <- extract(SISmm, spMadrid)
CMSAFMadrid <- zoo(t(CMSAFMadrid), as.yearmon(idx))
names(CMSAFMadrid) <- madridSIAR$Estacion
\end{lstlisting}
\begin{itemize}
\item Mostramos la serie temporal correspondiente
\end{itemize}

\lstset{language=R}
\begin{lstlisting}
xyplot(CMSAFMadrid,
       superpose=TRUE,
       auto.key=list(space='right'))
\end{lstlisting}
\end{frame}
\begin{frame}
\frametitle{Para los muy interesados}
\label{sec-4-4}


\begin{itemize}
\item Recientemente se ha publicado un artículo en la revista Renewable
  and Sustainable Energy Reviews comparando CM\~{}SAF y SIAR para
  diferentes condiciones de trabajo:
\begin{itemize}
\item ``Comparative assessment of global irradiation from a satellite
    estimate model (CM SAF) and on-ground measurements (SIAR): a
    Spanish case study'', F. Antoñanzas, F. Cañizares, O. Perpiñán, Renewable
    and Sustainable Energy Reviews, Volume 21, May 2013, Pages 248-261,
    ISSN 1364-0321, \href{http://dx.doi.org/10.1016/j.rser.2012.12.033}{http://dx.doi.org/10.1016/j.rser.2012.12.033}.
\item Se puede descargar el \href{http://procomun.files.wordpress.com/2012/12/cmsaf_siar_rev1.pdf}{preprint}, y el \href{https://github.com/oscarperpinan/CMSAF-SIAR}{código está disponible} con
    licencia libre.
\end{itemize}
\item AEMET ha publicado un \href{http://www.aemet.es/es/noticias/2012/05/atlasradiacionsolar}{Atlas de Radiación Solar} basado en los datos
  de CM\~{}SAF.
\end{itemize}
\end{frame}

\end{document}